Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: errQuoteExpected, ## ``"`` expected
ja: errQuoteExpected, ## ``"`` を検出した

source: fpGroupExec, ## execute access for the group
ja: fpGroupExec, ## グループの実行アクセス権

source: jsonInt, ## an integer literal
ja: jsonInt, ## 整数リテラル

source: nimblePaths, ## the nimble path(s)
ja: nimblePaths, ## nimble のパス

source: pcLinkToDir ## path refers to a symbolic link to a directory
ja: pcLinkToDir ## シンボリックリンクによるディレクトリの参照パス

source: sexpSymbol, ## a symbol
ja: sexpSymbol, ## シンボル

source: tagAcronym, ## the HTML ``acronym`` element
ja: tagAcronym, ## HTML ``acronym`` 要素

source: xnEntity, ## an entity (like ``&thing;``)
ja: xnEntity, ## エンティティ (``&thing;`` など)

source: tagFrame, ## the HTML ``frame`` element
ja: tagFrame, ## HTML ``frame`` 要素

source: tagFrameset, ## the deprecated HTML ``frameset`` element
ja: tagFrameset, ## 廃止された HTML ``frameset`` 要素

source: tagH1, ## the HTML ``h1`` element
ja: tagH1, ## HTML ``h1`` 要素

source: ## it for sandboxing)
ja: ## (サンドボックス化はサポートしていません)

source: strVal*: string ## AST leaf: the identifier, numeric literal
ja: strVal*: string ## 抽象構文木 (AST) のリーフ: 識別子、数値リテラル、

source: tagH2, ## the HTML ``h2`` element
ja: tagH2, ## HTML ``h2`` 要素

source: tagH3, ## the HTML ``h3`` element
ja: tagH3, ## HTML ``h3`` 要素

source: Clonezilla, SteamOS, Absolute, NixOS, ## NixOS or a Nix build environment
ja: Clonezilla, SteamOS, Absolute, NixOS, ## Unix OS または Unix ビルド環境

source: tagH4, ## the HTML ``h4`` element
ja: tagH4, ## HTML ``h4`` 要素

source: bgYellow, ## yellow
ja: bgYellow, ## 黄

source: doAssert inoty >= 0 ## Check for errors (FileHandle is alias to cint).
ja: doAssert inoty >= 0 ## エラーの確認 (FileHandle は cint のエイリアス)。

source: fgYellow, ## yellow
ja: fgYellow, ## 黄

source: kind*: RstNodeKind ## the node's kind
ja: kind*: RstNodeKind ## ノードの種類

source: roSupportMarkdown ## support additional features of markdown
ja: roSupportMarkdown ## markdown に関する追加機能のサポート

source: styleUnderscore, ## underscored text
ja: styleUnderscore, ## 下線付きテキスト

source: tagH5, ## the HTML ``h5`` element
ja: tagH5, ## HTML ``h5`` 要素

source: tagH6, ## the HTML ``h6`` element
ja: tagH6, ## HTML ``h6`` 要素

source: tagHead, ## the HTML ``head`` element
ja: tagHead, ## HTML ``head`` 要素

source: tagHeader, ## the HTML ``header`` element
ja: tagHeader, ## HTML ``header`` 要素

source: Posix, ## some Posix system
ja: Posix, ## POSIX システム

source: Verbose, ## Be verbose.
ja: Verbose, ## 詳細表示。

source: ai_socktype*: cint ## Socket type.
ja: ai_socktype*: cint ## ソケットの種類。

source: dbBool, ## boolean datatype
ja: dbBool, ## ブールによるデータ型

source: deletedA*: int ## Number of changes in Data A.
ja: deletedA*: int ## データ A の変更数。

source: errCommaExpected, ## ``,`` expected
ja: errCommaExpected, ## ``,`` を検出した

source: errEofExpected ## EOF expected
ja: errEofExpected ## EOF を検出した

source: f(2, 2) # is the same as: proc pass2(f: proc (x, y: float): float): float =
ja: f(2, 2) # は下記と同じです。 proc pass2(f: proc (x, y: float): float): float =

source: fmReadWriteExisting, ## Open the file for read and write access.
ja: fmReadWriteExisting, ## 読み書きアクセス可能でファイルを開きます。

source: fpGroupWrite, ## write access for the group
ja: fpGroupWrite, ## グループの書き込みアクセス権

source: jsonFloat, ## a float literal
ja: jsonFloat, ## 浮動小数リテラル

source: name*: string ## the name of the type
ja: name*: string ## 型の名前

source: outFile, ## experimental: the output file
ja: outFile, ## 試験機能: 出力ファイル

source: poStdErrToStdOut, ## Merge stdout and stderr to the stdout stream.
ja: poStdErrToStdOut, ## 標準出力と標準エラー出力を標準出力ストリームへ統合します。

source: searchPaths, ## the search path for modules
ja: searchPaths, ## モジュールの検索パス

source: sexpInt, ## an integer literal
ja: sexpInt, ## 整数リテラル

source: tagAddress, ## the HTML ``address`` element
ja: tagAddress, ## HTML ``address`` 要素

source: typ*: DbType ## type of the column
ja: typ*: DbType ## カラムの型

source: xnComment ## an XML comment
ja: xnComment ## XML コメント

source: tagHgroup, ## the HTML ``hgroup`` element
ja: tagHgroup, ## HTML ``hgroup`` 要素

source: tagHtml, ## the HTML ``html`` element
ja: tagHtml, ## HTML ``html`` 要素

source: tagHr, ## the HTML ``hr`` element
ja: tagHr, ## HTML ``hr`` 要素

source: # `f` will be a value of a type such as `Option[T]`
ja: # `f` は `Option[T]` などの型の値です。

source: maxBody: int ## The maximum content-length that will be read for the body.
ja: maxBody: int ## body (本文) を読み込んだときの最大コンテンツ長です。

source: tagI, ## the HTML ``i`` element
ja: tagI, ## HTML ``i`` 要素

source: tagIframe, ## the deprecated HTML ``iframe`` element
ja: tagIframe, ## 廃止された HTML ``iframe`` 要素

source: tagImg, ## the HTML ``img`` element
ja: tagImg, ## HTML ``img`` 要素

source: # `MatchedGenericType` will become the `Option` type
ja: # `MatchedGenericType` は `Option` 型となります。

source: # code
ja: # コード

source: bgBlue, ## blue
ja: bgBlue, ## 青

source: fgBlue, ## blue
ja: fgBlue, ## 青

source: lines*: string ## Lines that have been transferred.
ja: lines*: string ## 転送済み行数。

source: styleBlink, ## blinking/bold text
ja: styleBlink, ## 点滅・太字テキスト

source: tagInput, ## the HTML ``input`` element
ja: tagInput, ## HTML ``input`` 要素

source: tagIns, ## the HTML ``ins`` element
ja: tagIns, ## HTML ``ins`` 要素

source: tagIsindex, ## the deprecated HTML ``isindex`` element
ja: tagIsindex, ## 廃止された HTML ``isindex`` 要素

source: tagKbd, ## the HTML ``kbd`` element
ja: tagKbd, ## HTML ``kbd`` 要素

source: ## Output:
ja: ## 出力:

source: MacOSX, ## some version of OSX
ja: MacOSX, ## OSX のバージョン

source: Whatif ## Do not run commands, instead just echo what
ja: Whatif ## コマンドは実行しませんが、

source: b: ref B new(b) a = b echo($$a[]) # produces "{}", not "{f: 0}" # unmarshal let c = to[B]("""{"f": 2}""") assert typeof(c) is B assert c.f == 2 # marshal let s = $$c assert s == """{"f": 2}"""
ja: b: ref B new(b) a = b echo($$a[]) # "{f: 0}" ではなく、 "{}" を生成します。 # アンマーシャル let c = to[B]("""{"f": 2}""") assert typeof(c) is B assert c.f == 2 # マーシャル let s = $$c assert s == """{"f": 2}"""

source: dbBlob, ## blob datatype
ja: dbBlob, ## バイナリ形式の大規模オブジェクト (blob) によるデータ型

source: errBracketRiExpected, ## ``]`` expected
ja: errBracketRiExpected, ## ``]`` を検出した

source: fpGroupRead, ## read access for the group
ja: fpGroupRead, ## グループの読み取りアクセス権

source: input: Stream ## the input stream
ja: input: Stream ## 入力ストリーム

source: jsonTrue, ## the value ``true``
ja: jsonTrue, ## ``true`` 値

source: lazyPaths, ## experimental: even more paths
ja: lazyPaths, ## 試験機能: 追加の検索パス

source: outDir, ## the output directory
ja: outDir, ## 出力ディレクトリ

source: poParentStreams, ## Use the parent's streams.
ja: poParentStreams, ## 親ストリームを使います。

source: sexpFloat, ## a float literal
ja: sexpFloat, ## 浮動小数リテラル

source: tagApplet, ## the deprecated HTML ``applet`` element
ja: tagApplet, ## 廃止された HTML ``applet`` 要素

source: Since: Version 1.2.
ja: Version 1.2 以降

source: tagKeygen, ## the HTML ``keygen`` element
ja: tagKeygen, ## HTML ``keygen`` 要素

source: tagLabel, ## the HTML ``label`` element
ja: tagLabel, ## HTML ``label`` 要素

source: tagLegend, ## the HTML ``legend`` element
ja: tagLegend, ## HTML ``legend`` 要素

source: ## The first line
ja: ## 一行目

source: let watchdoge: cint = inotify_add_watch(inoty, ".", IN_ALL_EVENTS) ## Add directory to watchdog.
ja: let watchdoge: cint = inotify_add_watch(inoty, ".", IN_ALL_EVENTS) ## ウォッチドック (監視先) へディレクトリを追加します。

source: tagLi, ## the HTML ``li`` element
ja: tagLi, ## HTML ``li`` 要素

source: tagLink, ## the HTML ``link`` element
ja: tagLink, ## HTML ``link`` 要素

source: tagMap, ## the HTML ``map`` element
ja: tagMap, ## HTML ``map`` 要素

source: bgMagenta, ## magenta
ja: bgMagenta, ## 赤紫 (マゼンタ)

source: fgMagenta, ## magenta
ja: fgMagenta, ## 赤紫 (マゼンタ)

source: fmAppend ## Open the file for writing only; append data
ja: fmAppend ## 書き込み専用でファイルを開きます。

source: styleBlinkRapid, ## rapid blinking/bold text (not widely supported)
ja: styleBlinkRapid, ## 高速点滅・太字テキスト (一般的ではありません)

source: text*: string ## valid for leafs in the AST; and the title of
ja: text*: string ## 有効な抽象構文木 (AST) のリーフ、およびタイトル

source: tagMark, ## the HTML ``mark`` element
ja: tagMark, ## HTML ``mark`` 要素

source: tagMenu, ## the deprecated HTML ``menu`` element
ja: tagMenu, ## 廃止された HTML ``menu`` 要素

source: tagMeta, ## the HTML ``meta`` element
ja: tagMeta, ## HTML ``meta`` 要素

source: tagMeter, ## the HTML ``meter`` element
ja: tagMeter, ## HTML ``meter`` 要素

source: Linux, ## some version of Linux
ja: Linux, ## Linux のバージョン

source: ai_protocol*: cint ## Protocol of socket.
ja: ai_protocol*: cint ## ソケットのプロトコル。

source: commandArgs, ## the arguments passed to the Nim compiler
ja: commandArgs, ## Nim コンパイラに渡される引数

source: dbFixedChar, ## string of fixed length
ja: dbFixedChar, ## 固定長文字列

source: errCurlyRiExpected, ## ``}`` expected
ja: errCurlyRiExpected, ## ``}`` を検出した

source: fpOthersExec, ## execute access for others
ja: fpOthersExec, ## 一般ユーザの実行アクセス権

source: insertedB*: int ## Number of changes in Data B.
ja: insertedB*: int ## データ B の変更数。

source: jsonFalse, ## the value ``false``
ja: jsonFalse, ## ``false`` 値

source: nimcacheDir, ## the location of the 'nimcache' directory
ja: nimcacheDir, ## 'nimcache' ディレクトリの場所

source: primaryKey*: bool ## is this a primary key?
ja: primaryKey*: bool ## これはプライマリキーであるか？

source: sexpNil, ## the value ``nil``
ja: sexpNil, ## ``nil`` 値

source: size*: Natural ## the size of the datatype; 0 if of variable size
ja: size*: Natural ## データ型のサイズ。 0 ならば可変長サイズ

source: tagArea, ## the HTML ``area`` element
ja: tagArea, ## HTML ``area`` 要素

source: tagNav, ## the HTML ``nav`` element
ja: tagNav, ## HTML ``nav`` 要素

source: tagNobr, ## the deprecated HTML ``nobr`` element
ja: tagNobr, ## 廃止された HTML ``nobr`` 要素

source: tagNoframes, ## the deprecated HTML ``noframes`` element
ja: tagNoframes, ## 廃止された HTML ``noframes`` 要素

source: ai_flags*: cint ## Input flags.
ja: ai_flags*: cint ## 入力フラグ群。

source: cmsg_len*: SockLen ## Data byte count, including the cmsghdr.
ja: cmsg_len*: SockLen ## cmsghdr を対象とした、データバイト数。

source: f_bsize*: int ## File system block size.
ja: f_bsize*: int ## ファイルシステムのブロックサイズ。

source: fd*: cint ## The following descriptor being polled.
ja: fd*: cint ## ポーリングの監視をするディスクリプタ。

source: gl_pathc*: int ## Count of paths matched by pattern.
ja: gl_pathc*: int ## パターンに一致したパスの本数。

source: gr_name*: cstring ## The name of the group.
ja: gr_name*: cstring ## グループ名。

source: h_name*: cstring ## Official name of the host.
ja: h_name*: cstring ## ホストの正式名称。

source: if_index*: cint ## Numeric index of the interface.
ja: if_index*: cint ## インターフェースの数値インデックス。

source: iov_base*: pointer ## Base address of a memory region for input or output.
ja: iov_base*: pointer ## 入力または出力用メモリ領域の基底アドレス。

source: ipv6mr_multiaddr*: In6Addr ## IPv6 multicast address.
ja: ipv6mr_multiaddr*: In6Addr ## IPv6 マルチキャストアドレス。

source: it_interval*: Timespec ## Timer period.
ja: it_interval*: Timespec ## タイマーの期間。

source: l_onoff*: cint ## Indicates whether linger option is enabled.
ja: l_onoff*: cint ## linger オプションの有効状態。

source: l_type*: cshort ## Type of lock; F_RDLCK, F_WRLCK, F_UNLCK.
ja: l_type*: cshort ## ロックの種類 (F_RDLCK, F_WRLCK, F_UNLCK)

source: mq_flags*: int ## Message queue flags.
ja: mq_flags*: int ## メッセージキューのフラグ。

source: msg_name*: pointer ## Optional address.
ja: msg_name*: pointer ## オプションのアドレス。

source: n_name*: cstring ## Official, fully-qualified (including the
ja: n_name*: cstring ## 正式なホストの完全修飾名

source: p_name*: cstring ## Official name of the protocol.
ja: p_name*: cstring ## プロトコルの正式名称。

source: pw_name*: cstring ## User's login name.
ja: pw_name*: cstring ## ユーザのログイン名。

source: sa_family*: TSa_Family ## Address family.
ja: sa_family*: TSa_Family ## アドレスファミリ。

source: si_signo*: cint ## Signal number.
ja: si_signo*: cint ## シグナル番号。

source: sigev_notify*: cint ## Notification type.
ja: sigev_notify*: cint ## 通知の種類。

source: sival_ptr*: pointer ## pointer signal value;
ja: sival_ptr*: pointer ## シグナル値のポインタ。

source: sons*: seq[SqlNode] ## the node's children
ja: sons*: seq[SqlNode] ## ノードの子孫

source: ss_family*: TSa_Family ## Address family.
ja: ss_family*: TSa_Family ## アドレスファミリ。

source: ss_onstack*: cint ## Non-zero when signal stack is in use.
ja: ss_onstack*: cint ## シグナルスタックを使用しているときは非ゼロ。

source: ss_sp*: pointer ## Stack base or pointer.
ja: ss_sp*: pointer ## スタックベースまたはポインタ。

source: st_dev*: Dev ## Device ID of device containing file.
ja: st_dev*: Dev ## ファイルがあるデバイスのデバイス ID

source: sun_family*: TSa_Family ## Address family.
ja: sun_family*: TSa_Family ## アドレスファミリ。

source: tm_sec*: cint ## Seconds [0,60].
ja: tm_sec*: cint ## 秒 [0,60]

source: tv_sec*: Time ## Seconds.
ja: tv_sec*: Time ## 秒。

source: uid*: Uid ## Owner's user ID.
ja: uid*: Uid ## 所有者のユーザ ID

source: wd* {...}{.importc: "wd".}: FileHandle ## Watch descriptor.
ja: wd* {...}{.importc: "wd".}: FileHandle ## 監視用ディスクリプタ。

source: tagNoscript, ## the HTML ``noscript`` element
ja: tagNoscript, ## HTML ``noscript`` 要素

source: tagObject, ## the HTML ``object`` element
ja: tagObject, ## HTML ``object`` 要素

source: tagOl, ## the HTML ``ol`` element
ja: tagOl, ## HTML ``ol`` 要素

source: bgCyan, ## cyan
ja: bgCyan, ## 青緑 (シアン)

source: fgCyan, ## cyan
ja: fgCyan, ## 青緑 (シアン)

source: lineNumber*: int ## the current line number
ja: lineNumber*: int ## 現在の行数

source: of EvRetr, EvStore: ## Retr/Store operation finished.
ja: of EvRetr, EvStore: ## Retr/Store 処理の完了。

source: styleReverse, ## reverse
ja: styleReverse, ## 反転表示

source: tagOptgroup, ## the HTML ``optgroup`` element
ja: tagOptgroup, ## HTML ``optgroup`` 要素

source: tagOption, ## the HTML ``option`` element
ja: tagOption, ## HTML ``option`` 要素

source: tagOutput, ## the HTML ``output`` element
ja: tagOutput, ## HTML ``output`` 要素

source: tagP, ## the HTML ``p`` element
ja: tagP, ## HTML ``p`` 要素

source: cincludes, ## the #include paths passed to the C/C++ compiler
ja: cincludes, ## C/C++ コンパイラに渡される #include パス

source: dbVarchar, ## string datatype
ja: dbVarchar, ## 文字列によるデータ型

source: errQuoteExpected, ## ``"`` or ``'`` expected
ja: errQuoteExpected, ## ``"`` または ``'`` を検出した

source: fpOthersWrite, ## write access for others
ja: fpOthersWrite, ## 一般ユーザの書き込みアクセス権

source: jsonNull, ## the value ``null``
ja: jsonNull, ## ``null`` 値

source: projectName, ## the project's name that is being compiled
ja: projectName, ## コンパイルされたプロジェクトの名前

source: sexpDot, ## the dot to separate car/cdr
ja: sexpDot, ## car/cdr を分離するドット

source: tagArticle, ## the HTML ``article`` element
ja: tagArticle, ## HTML ``article`` 要素

source: tagParam, ## the HTML ``param`` element
ja: tagParam, ## HTML ``param`` 要素

source: tagPre, ## the HTML ``pre`` element
ja: tagPre, ## HTML ``pre`` 要素

source: tagProgress, ## the HTML ``progress`` element
ja: tagProgress, ## HTML ``progress`` 要素

source: chan.send("Hello World!") # This is another proc to run in a background thread.
ja: chan.send("Hello World!") # ここでは別のプロシージャをバックグラウンド・スレッドで実行します。

source: tagQ, ## the HTML ``q`` element
ja: tagQ, ## HTML ``q`` 要素

source: tagRp, ## the HTML ``rp`` element
ja: tagRp, ## HTML ``rp`` 要素

source: tagRt, ## the HTML ``rt`` element
ja: tagRt, ## HTML ``rt`` 要素

source: ## at the process' output streams.
ja: ## にするために名前付きパイプが使われます。

source: bgWhite, ## white
ja: bgWhite, ## 白

source: fgWhite, ## white
ja: fgWhite, ## 白

source: level*: int ## valid for some node kinds
ja: level*: int ## 有効なノードの種類

source: of gtEof: break # End Of File (or string)
ja: of gtEof: break # ファイル終端子 EOF (または文字列)

source: styleHidden, ## hidden text
ja: styleHidden, ## テキストの非表示

source: tagRuby, ## the HTML ``ruby`` element
ja: tagRuby, ## HTML ``ruby`` 要素

source: tagS, ## the deprecated HTML ``s`` element
ja: tagS, ## 廃止された HTML ``s`` 要素

source: tagSamp, ## the HTML ``samp`` element
ja: tagSamp, ## HTML ``samp`` 要素

source: tagScript, ## the HTML ``script`` element
ja: tagScript, ## HTML ``script`` 要素

source: ## Values can be uppercase too.
ja: ## 値には大文字も使えます。

source: ai_addrlen*: csize_t ## Length of socket address.
ja: ai_addrlen*: csize_t ## ソケットのアドレス長。

source: clibs ## libraries passed to the C/C++ compiler
ja: clibs ## C/C++ コンパイラに渡されるライブラリ

source: dbJson, ## JSON datatype
ja: dbJson, ## JSON よるデータ型

source: echo row # Output: # @["1", "item#1"] # @["2", "item#2"] db.close()
ja: echo row # 出力: # @["1", "item#1"] # @["2", "item#2"] db.close()

source: echo row ## Output: ## @["1", "item#1"] ## @["2", "item#2"] db.close()
ja: echo row ## 出力: ## @["1", "item#1"] ## @["2", "item#2"] db.close()

source: errEOC_Expected, ## ``*/`` expected
ja: errEOC_Expected, ## ``*/`` を検出した

source: foreignKey*: bool ## is this a foreign key?
ja: foreignKey*: bool ## これは外部キーであるか？

source: fpOthersRead ## read access for others
ja: fpOthersRead ## 一般ユーザの読み取りアクセス権

source: jsonObjectStart, ## start of an object: the ``{`` token
ja: jsonObjectStart, ## オブジェクトの開始: ``{`` トークン

source: maxReprLen*: Natural ## maximal length required for the representation
ja: maxReprLen*: Natural ## 表現で必要とされる最大長

source: poDaemon ## Windows: The program creates no Window.
ja: poDaemon ## Windows: プログラムのウィンドウを作成しません。

source: projectPath, ## experimental: some path to the project that is being compiled
ja: projectPath, ## 試験機能: コンパイルされたプロジェクトのパス

source: sexpListStart, ## start of a list: the ``(`` token
ja: sexpListStart, ## リストの始点: ``(`` トークン

source: tagAside, ## the HTML ``aside`` element
ja: tagAside, ## HTML ``aside`` 要素

source: tagSection, ## the HTML ``section`` element
ja: tagSection, ## HTML ``section`` 要素

source: tagSelect, ## the HTML ``select`` element
ja: tagSelect, ## HTML ``select`` 要素

source: tagSmall, ## the HTML ``small`` element
ja: tagSmall, ## HTML ``small`` 要素

source: # Use allocShared0 to allocate some shared-heap memory and zero it.
ja: # allocShared0 を使うと共有ヒープの割り当てとゼロクリアを行います。

source: ## domain) name of the host.
ja: ## (ドメインも対象)。

source: cmsg_level*: cint ## Originating protocol.
ja: cmsg_level*: cint ## 送信元のプロトコル。

source: d_dev*: Dev ## Device (not POSIX)
ja: d_dev*: Dev ## デバイス (非 POSIX)

source: events*: cshort ## The input event flags (see below).
ja: events*: cshort ## 入力イベントのフラグ (後述参照)。

source: f_frsize*: int ## Fundamental file system block size.
ja: f_frsize*: int ## ファイルシステムの基本ブロックサイズ。

source: gid*: Gid ## Owner's group ID.
ja: gid*: Gid ## 所有者のグループ ID

source: gl_pathv*: cstringArray ## Pointer to a list of matched pathnames.
ja: gl_pathv*: cstringArray ## パス名に一致したリストのポインタ。

source: gr_gid*: Gid ## Numerical group ID.
ja: gr_gid*: Gid ## 数値グループ ID

source: if_name*: cstring ## Null-terminated name of the interface.
ja: if_name*: cstring ## インタフェース名 (NULL 終端)。

source: iov_len*: int ## The size of the memory pointed to by iov_base.
ja: iov_len*: int ## iov_base により指されているメモリの大きさ。

source: ipv6mr_interface*: cint ## Interface index.
ja: ipv6mr_interface*: cint ## インターフェースのインデックス。

source: it_value*: Timespec ## Timer expiration.
ja: it_value*: Timespec ## タイマーの期限。

source: l_linger*: cint ## Linger time, in seconds.
ja: l_linger*: cint ## 秒単位による残存時間。

source: l_whence*: cshort ## Flag for starting offset.
ja: l_whence*: cshort ## 開始オフセットのフラグ

source: mq_maxmsg*: int ## Maximum number of messages.
ja: mq_maxmsg*: int ## 最大メッセージ数。

source: msg_namelen*: SockLen ## Size of address.
ja: msg_namelen*: SockLen ## アドレスのサイズ。

source: pw_uid*: Uid ## Numerical user ID.
ja: pw_uid*: Uid ## 値によるユーザ ID

source: sa_data*: array[0 .. 255, char] ## Socket address (variable-length data).
ja: sa_data*: array[0 .. 255, char] ## ソケットのアドレス (可変長データ)。

source: si_code*: cint ## Signal code.
ja: si_code*: cint ## シグナルコード。

source: sigev_signo*: cint ## Signal number.
ja: sigev_signo*: cint ## シグナル番号。

source: sin6_port*: InPort ## Port number.
ja: sin6_port*: InPort ## ポート番号。

source: sin_port*: InPort ## Port number.
ja: sin_port*: InPort ## ポート番号。

source: ss_size*: int ## Stack size.
ja: ss_size*: int ## スタックサイズ。

source: ss_sp*: pointer ## Signal stack pointer.
ja: ss_sp*: pointer ## シグナルスタックのポインタ。

source: st_ino*: Ino ## File serial number.
ja: st_ino*: Ino ## ファイルのシリアル番号。

source: sun_path*: array[0 .. 92 - 1, char] ## Socket path
ja: sun_path*: array[0 .. 92 - 1, char] ## ソケットのパス

source: tm_min*: cint ## Minutes [0,59].
ja: tm_min*: cint ## 分 [0,59]

source: tv_nsec*: int ## Nanoseconds.
ja: tv_nsec*: int ## ナノ秒。

source: tv_usec*: Suseconds ## Microseconds.
ja: tv_usec*: Suseconds ## ミリ秒。

source: ## Input (somefile.txt):
ja: ## 入力 (somefile.txt):

source: Index + (Ctrl+F) == Joy
ja: 索引 + (Ctrl+F) == たのしい

source: tagSource, ## the HTML ``source`` element
ja: tagSource, ## HTML ``source`` 要素

source: tagSpan, ## the HTML ``span`` element
ja: tagSpan, ## HTML ``span`` 要素

source: tagStrike, ## the deprecated HTML ``strike`` element
ja: tagStrike, ## 廃止された HTML ``strike`` 要素

source: # The usual warnings about dealing with raw pointers apply.
ja: # 通常、生ポインタを扱うと警告が発生します。

source: bg8Bit, ## 256-color (not supported, see ``enableTrueColors`` instead.)
ja: bg8Bit, ## 256 色 (非対応のため、代替策は ``enableTrueColors`` を参照)

source: fg8Bit, ## 256-color (not supported, see ``enableTrueColors`` instead.)
ja: fg8Bit, ## 256 色 (非対応のため、代替策は ``enableTrueColors`` を参照)

source: n_aliases*: cstringArray ## A pointer to an array of pointers to
ja: n_aliases*: cstringArray ## 代替ネットワーク名の

source: styleStrikethrough ## strikethrough
ja: styleStrikethrough ## 取り消し線

source: tagStrong, ## the HTML ``strong`` element
ja: tagStrong, ## HTML ``strong`` 要素

source: tagStyle, ## the HTML ``style`` element
ja: tagStyle, ## HTML ``style`` 要素

source: tagSub, ## the HTML ``sub`` element
ja: tagSub, ## HTML ``sub`` 要素

source: tagSummary, ## the HTML ``summary`` element
ja: tagSummary, ## HTML ``summary`` 要素

source: dbXml, ## XML datatype
ja: dbXml, ## XML よるデータ型

source: errEofExpected, ## EOF expected
ja: errEofExpected, ## EOF を検出した

source: jsonObjectEnd, ## end of an object: the ``}`` token
ja: jsonObjectEnd, ## オブジェクトの終了: ``}`` トークン

source: projectFull, ## the full path to the project that is being compiled
ja: projectFull, ## コンパイルされたプロジェクトのフルパス

source: sexpListEnd ## end of a list: the ``)`` token
ja: sexpListEnd ## リストの終点: ``)`` トークン

source: tagAudio, ## the HTML ``audio`` element
ja: tagAudio, ## HTML ``audio`` 要素

source: tagSup, ## the HTML ``sup`` element
ja: tagSup, ## HTML ``sup`` 要素

source: tagTable, ## the HTML ``table`` element
ja: tagTable, ## HTML ``table`` 要素

source: tagTbody, ## the HTML ``tbody`` element
ja: tagTbody, ## HTML ``tbody`` 要素

source: sons*: RstNodeSeq ## the node's sons
ja: sons*: RstNodeSeq ## ノードの息子

source: tagTd, ## the HTML ``td`` element
ja: tagTd, ## HTML ``td`` 要素

source: tagTextarea, ## the HTML ``textarea`` element
ja: tagTextarea, ## HTML ``textarea`` 要素

source: tagTfoot, ## the HTML ``tfoot`` element
ja: tagTfoot, ## HTML ``tfoot`` 要素

source: bgDefault ## default terminal background color
ja: bgDefault ## ターミナルの背景表示色 (デフォルト)

source: fgDefault ## default terminal foreground color
ja: fgDefault ## ターミナルの文字表示色 (デフォルト)

source: tagTh, ## the HTML ``th`` element
ja: tagTh, ## HTML ``th`` 要素

source: tagThead, ## the HTML ``thead`` element
ja: tagThead, ## HTML ``thead`` 要素

source: tagTime, ## the HTML ``time`` element
ja: tagTime, ## HTML ``time`` 要素

source: tagTitle, ## the HTML ``title`` element
ja: tagTitle, ## HTML ``title`` 要素

source: ai_canonname*: cstring ## Canonical name of service location.
ja: ai_canonname*: cstring ## サービスロケーションの正規名。

source: bytesTotal*: BiggestInt ## Bytes total.
ja: bytesTotal*: BiggestInt ## 合計バイト数。

source: d_pdev*: Dev ## Parent device (only for queries) (not POSIX)
ja: d_pdev*: Dev ## 親デバイス (クエリ専用) (非 POSIX)

source: dbInt, ## some integer type
ja: dbInt, ## 整数型
